app/Controllers/Mahasiswa.php

    public function index()
    {
        $data['nilai'] = $this->model->findAll();
---
SELECT *
FROM `nilai`